FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_USBHost.c
/*-------------------------------------------------------------------------*
 * File:  LPC546xx_USBHost.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC546xx USBHost Interface as pulled
 *      from NXP's USB Host Stack.
 * Implementation:
 *      This implementation still assumes that there is one major form
 *      of communication needed.  Descriptors are described and allocated
 *      by the next level up.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Include Files:
 *---------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZ.h>
#include <uEZProcessor.h>
#include <Source/Processor/NXP/LPC546xx/LPC546xx_USBHost.h>

#warning "Remove"
#include "CMSIS/LPC546xx.h"

/*---------------------------------------------------------------------------*
 * Regions:
 *---------------------------------------------------------------------------*/
#if ((COMPILER_TYPE==RowleyARM) || (COMPILER_TYPE==Keil4))
    #define USBHOST_MEMORY __attribute__((section(".usbhostmem")));
#elif (COMPILER_TYPE==IAR)
    #define USBHOST_MEMORY @ ".usbhostmem"
#else
    #define USBHOST_MEMORY // no mods
#endif

/*---------------------------------------------------------------------------*
 * Registers:
 *---------------------------------------------------------------------------*/
#define TIMEOUT_STANDARD        10000   // 10 SECONDS

/*---------------------------------------------------------------------------*
 * Macros and Constants:
 *---------------------------------------------------------------------------*/

// NOTE: Rh = Root Hub, Rc = Root Controller
// More details about OHCI can be found at:
//   ftp://ftp.compaq.com/pub/supportinformation/papers/hcir1_0a.pdf

/* ------------------ HcControl Register ---------------------  */
// ControlbulkSeriveRatio: Ratio between control and bulk EDs
#define  OR_CONTROL_CBSR_MASK           0x00000003
#define  OR_CONTROL_CBSR_1_TO_1         0x00000000 // default
#define  OR_CONTROL_CBSR_2_TO_1         0x00000001
#define  OR_CONTROL_CBSR_3_TO_1         0x00000002
#define  OR_CONTROL_CBSR_4_TO_1         0x00000003
#define  OR_CONTROL_PLE                 0x00000004  // PeriodListEnable
#define  OR_CONTROL_ILE                 0x00000008  // IsochronousEnable
#define  OR_CONTROL_CLE                 0x00000010  // ControlListEanble
#define  OR_CONTROL_BLE                 0x00000020  // BulkListEnable
#define  OR_CONTROL_HCFS                0x000000C0  // HostControllerFunctionalState
#define  OR_CONTROL_HCFS_USB_RESET      0x00000000
#define  OR_CONTROL_HCFS_USB_RESUME     0x00000040
#define  OR_CONTROL_HCFS_USB_OPERATION  0x00000080
#define  OR_CONTROL_HCFS_USB_SUSPEND    0x000000C0
#define  OR_CONTROL_HC_OPER             0x00000080
#define  OR_CONTROL_IR                  0x00000100 // InterruptRouting
#define  OR_CONTROL_RWC                 0x00000200 // RemoteWakeupConnected
#define  OR_CONTROL_RWE                 0x00000400 // RemoteWakeupEnable
/* ----------------- HcCommandStatus Register ----------------- */
#define  OR_CMD_STATUS_HCR              0x00000001
#define  OR_CMD_STATUS_CLF              0x00000002
#define  OR_CMD_STATUS_BLF              0x00000004
/* --------------- HcInterruptStatus Register ----------------- */
#define  OR_INTR_STATUS_WDH             0x00000002
#define  OR_INTR_STATUS_RHSC            0x00000040
/* --------------- HcInterruptEnable Register ----------------- */
#define  OR_INTR_ENABLE_WDH             0x00000002
#define  OR_INTR_ENABLE_RHSC            0x00000040
#define  OR_INTR_ENABLE_MIE             0x80000000
/* ---------------- HcRhDescriptorA Register ------------------ */
#define  OR_RH_STATUS_LPSC              0x00010000
/* -------------- HcRhPortStatus[1:NDP] Register -------------- */
#define  OR_RH_PORT_CCS                 0x00000001  // Current connect status
#define  OR_RH_PORT_POWER_ENABLE_STATUS 0x00000002  // Port eanble status (write bit to set port enable)
#define  OR_RH_PORT_PORT_SUSPEND_STATUS 0x00000004  // Port suspend status (write bit to set port suspend)
#define  OR_RH_PORT_OVER_CURRENT_STATUS 0x00000008  // Over current status (write bit to clear port suspend)
#define  OR_RH_PORT_PRS                 0x00000010  // Port reset status (write bit to set port reset)
#define  OR_RH_PORT_POWER_STATUS        0x00000100  // Power port device status (write bit to set port power)
#define  OR_RH_PORT_LOW_SPEED_ATTACHED  0x00000200  // Low speed device attached (write bit to clear port power)
#define  OR_RH_PORT_CSC                 0x00010000  // Connect status change
#define  OR_RH_PORT_ENABLE_CHANGE       0x00020000  // Port enable status change
#define  OR_RH_PORT_SUSPEND_CHG         0x00040000  // Port suspend status change
#define  OR_RH_PORT_OVER_CURRENT_CHG    0x00080000  // Over Current indicator change
#define  OR_RH_PORT_PRSC                0x00100000  // Port reset status change

#define  FI                     0x2EDF           /* Frame Interval: 12000 bits per frame (-1)                               */
#define  DEFAULT_FMINTERVAL     ((((6 * (FI - 210)) / 7) << 16) | FI)
#define  PERIODIC_START         0x00002A27UL        /* About 10% of the frame interval */

// Transfer Descriptor control fields
#define  TD_ROUNDING        (TUInt32) (0x00040000)        /* Buffer Rounding                             */
#define  TD_SETUP           (TUInt32)(0)                  /* Direction of Setup Packet                   */
#define  TD_IN              (TUInt32)(0x00100000)         /* Direction In                                */
#define  TD_OUT             (TUInt32)(0x00080000)         /* Direction Out                               */
#define  TD_DELAY_INT(x)    (TUInt32)((x) << 21)          /* Delay Interrupt                             */
#define  TD_TOGGLE_0        (TUInt32)(0x02000000)         /* Toggle 0                                    */
#define  TD_TOGGLE_1        (TUInt32)(0x03000000)         /* Toggle 1                                    */
#define  TD_CC              (TUInt32)(0xF0000000)         /* Completion Code                             */

// Endpoint descriptor Control field macros
#define ED_ADDRESS(x)           (TUInt32)(((x)0x7F)<<0)     //!< Address of target device (0-127)
#define ED_ENDPOINT_NUMBER(en)  (TUInt32)((en & 0x0F)<<7)   //!< Endpoint number (0-15)
#define ED_DIR_FROM_TD          (TUInt32)(0<<11)            //!< Direction of end point comes from transfer descriptor (default)
#define ED_DIR_OUT              (TUInt32)(1<<11)            //!< Direction of end point is always OUT
#define ED_DIR_IN               (TUInt32)(2<<11)            //!< Direction of end point is always IN
#define ED_SPEED_FULL           (TUInt32)(0<<13)            //!< Full speed endpoint connection
#define ED_SPEED_LOW            (TUInt32)(1<<13)            //!< Low speed endpoint connection
#define ED_SKIP                 (TUInt32)(1<<14)            //!< Skip this endpoint
#define ED_FORMAT_GENERAL       (TUInt32)(0<<15)            //!< Control, Bulk, or Interrupt endpoint
#define ED_FORMAT_ISOCHRONOUS   (TUInt32)(1<<15)            //!< Isochronouse endpoint
#define ED_MAX_PACKET_SIZE(m)   (TUInt32)(((m)&0x7FF)<<16)  //!< Maximum packet size

/*---------------------------------------------------------------------------*
 * Macros:
 *---------------------------------------------------------------------------*/
#define  DESC_LENGTH(x)  x[0]
#define  DESC_TYPE(x)    x[1]


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/

