FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_USBHost.c
    IRQ_END();
}

/*
**************************************************************************************************************
*                                          FILL SETUP PACKET
*
* Description: This function is used to fill the setup packet
*
* Arguments  : None
*
* Returns    : OK		              if Success
*              ERR_INVALID_BOOTSIG    if Failed
*
**************************************************************************************************************
*/

/*---------------------------------------------------------------------------*
 * Routine:  IHost_FillSetup
 *---------------------------------------------------------------------------*
 * Description:
 *      Fill a setup packet
 * Inputs:
 *      T_LPC546xx_USBHost_Workspace *p -- USB Host controller workspace
 *      TUInt8 aBMRequestType       -- Type of request
 *      TUInt8 aRequest             -- Request
 *      TUInt16 aValue              -- Value for request
 *      TUInt16 aIndex              -- Index for request
 *      TUInt16 aLength             -- Length of data in command
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void IHost_FillSetup(
        T_LPC546xx_USBHost_Workspace *p,
        TUInt8   aBMRequestType,
        TUInt8   aRequest,
        TUInt16   aValue,
        TUInt16   aIndex,
        TUInt16   aLength)
{
    TDBuffer[0] = aBMRequestType;
    TDBuffer[1] = aRequest;
    WriteLE16U(&TDBuffer[2], aValue);
    WriteLE16U(&TDBuffer[4], aIndex);
    WriteLE16U(&TDBuffer[6], aLength);
}



/*
**************************************************************************************************************
*                                         INITIALIZE THE TRANSFER DESCRIPTOR
*
* Description: This function initializes transfer descriptor
*
* Arguments  : Pointer to TD structure
*
* Returns    : None
*
**************************************************************************************************************
*/
static void IHost_TDInit(volatile  HCTD *td)
{
    td->Control    = 0;
    td->CurrBufPtr = 0;
    td->Next       = 0;
    td->BufEnd     = 0;
}

/*
**************************************************************************************************************
*                                         INITIALIZE THE ENDPOINT DESCRIPTOR
*
* Description: This function initializes endpoint descriptor
*
* Arguments  : Pointer to ED strcuture
*
* Returns    : None
*
**************************************************************************************************************
*/
static void IHost_EDInit (volatile  HCED *aEndDesc)
{
    static TUInt32 iFirst = 0;

    aEndDesc->Control = 0;
    aEndDesc->TailTd  = 0;
    aEndDesc->HeadTd  = 0;
    aEndDesc->Next    = iFirst;
    iFirst = (TUInt32)aEndDesc;
}

/*
**************************************************************************************************************
*                                 INITIALIZE HOST CONTROLLER COMMUNICATIONS AREA
*
* Description: This function initializes host controller communications area
*
* Arguments  : Pointer to HCCA
*
* Returns    :
*
**************************************************************************************************************
*/
static void IHost_HCCAInit (volatile  HCCA  *hcca)
{
    TUInt32  i;

    for (i = 0; i < 32; i++) {
        hcca->IntTable[i] = (TUInt32)EDInterruptIn;
        hcca->FrameNumber = i;
        hcca->DoneHead    = 0;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IAllocBuffer
 *---------------------------------------------------------------------------*
 * Description:
 *      Allocate data in the USB Data area (if room for allocation)
 * Inputs:
 *      T_LPC546xx_USBHost_Workspace *p -- USB Host controller workspace
 *      TUInt32 aBufferSize         -- Number of bytes required
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void *IAllocBuffer(
        T_LPC546xx_USBHost_Workspace *p,
        TUInt32 aBufferSize)
{
    void *p_buffer = p->iAllocBase;

    // Determine if there is enough room
    if (p->iAllocRemaining < aBufferSize)
        return 0;

    // There is enough room
    // Move the base to the next location
    // and mark off the space used
    p->iAllocBase += aBufferSize;
    p->iAllocRemaining -= aBufferSize;

    // Return the original base address
    return p_buffer;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_AllocBuffer
 *---------------------------------------------------------------------------*
 * Description:
 *      Allocate USB memory.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt32 aSize               -- Number of bytes required
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void *Host_AllocBuffer(void *aWorkspace, TUInt32 aSize)
{
    T_LPC546xx_USBHost_Workspace *p = (T_LPC546xx_USBHost_Workspace *)aWorkspace;
    return IAllocBuffer(p, aSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_USBHost_InitializeWorkspace_PortA
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Host to work on Port A
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 * Outputs:
 *      T_uezError                  -- Any error if failed
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_USBHost_InitializeWorkspace_PortA(void *aWorkspace)
{
    T_LPC546xx_USBHost_Workspace *p = (T_LPC546xx_USBHost_Workspace *)aWorkspace;
    p->iPortIndex = USB_HOST_PORT_INDEX_PORT_A;
    p->iPortStatus = (volatile TUInt32 *)&LPC_USB->HcRhPortStatus1;
    p->iAllocRemaining = 0; // Not ready yet
    p->iCallbackAPI = 0;
    p->iCallbackWorkspace = 0;
    p->iSpeed = USB_HOST_SPEED_FULL;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_USBHost_InitializeWorkspace_PortB
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Host to work on Port B
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 * Outputs:
 *      T_uezError                  -- Any error if failed
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_USBHost_InitializeWorkspace_PortB(void *aWorkspace)
{
    T_LPC546xx_USBHost_Workspace *p = (T_LPC546xx_USBHost_Workspace *)aWorkspace;
    p->iPortIndex = USB_HOST_PORT_INDEX_PORT_B;
    p->iPortStatus = (volatile TUInt32 *)&LPC_USB->HcRhPortStatus2;
    p->iAllocRemaining = 0; // Not ready yet
    p->iCallbackAPI = 0;
    p->iCallbackWorkspace = 0;
    p->iSpeed = USB_HOST_SPEED_FULL;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_Init
 *---------------------------------------------------------------------------*
 * Description:
 *      Initializes the LPC546xx host controller with buffers
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *---------------------------------------------------------------------------*/
static T_uezError Host_Init(void *aWorkspace)
{
    extern void USBSharedInterruptSetup(void);
    T_LPC546xx_USBHost_Workspace *p = (T_LPC546xx_USBHost_Workspace *)aWorkspace;

